# fmt: off
RU: dict[str, str] = {
    "/start": "📚 Расписание занятий РГУ нефти и газа (НИУ) им. И. М. Губкина — Ташкент\n\n"
              "Этот бот помогает студентам филиала в Ташкенте быстро получать актуальное расписание занятий по своей группе.\n\n" # noqa
              "Чтобы начать работу, пройди регистрацию и выбери свою учебную группу.\n\n"
              "➡️ Отправь команду /register",
    "/schedule_loading": "📡 Загружаю расписание занятий…\n\n"
                         "Это может занять несколько секунд.",
    "/register_loading": "⏳ Получаю список учебных групп…\n\n"
                         "Пожалуйста, подожди несколько секунд.",
    "/register_successful": "✅ Регистрация завершена\n\n"
                            "Ты успешно зарегистрирован и привязан к выбранной группе.\n\n"
                            "📅 Чтобы получить расписание занятий, отправь команду /schedule",
    "/register": "👥 Выбор учебной группы\n\n"
                 "Пожалуйста, выбери свою группу из списка ниже 👇\n\n"
                 "Если допустил ошибку, группу можно будет изменить позже.",
    "user_not_registered": "Вы сможете увидеть расписание только после регистрации.\n\n"
                           "Для прохождения регистрации отправьте команду /register",
    "/start_description": "Перезапустить бота",
    "/register_description": "Выбрать группу",
    "/schedule_description": "Получить расписание",
}
# fmt: on
